frivas12/rt1064_usb_combo/evkmimxrt1064_host_hid_generic_freertos_usb_cdc_HID/source/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< Signal name */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< Signal name */

/* GPIO_B1_00 (coord A11), RT1064 SPCK */
/* Routed pin properties */
#define BOARD_INITPINS_RT1064_SPCK_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RT1064_SPCK_SIGNAL                                   IO16   /*!< Signal name */

/* GPIO_B1_01 (coord B11), RT1064 SPI CS */
/* Routed pin properties */
#define BOARD_INITPINS_RT1064_SPI_CS_PERIPHERAL                             GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RT1064_SPI_CS_SIGNAL                                 IO17   /*!< Signal name */

/* GPIO_B1_02 (coord C11), MOSI */
/* Routed pin properties */
#define BOARD_INITPINS_MOSI_PERIPHERAL                                      GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MOSI_SIGNAL                                          IO18   /*!< Signal name */

/* GPIO_B1_03 (coord D11), MISO */
/* Routed pin properties */
#define BOARD_INITPINS_MISO_PERIPHERAL                                      GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MISO_SIGNAL                                          IO19   /*!< Signal name */

/* GPIO_B1_04 (coord E12), RT1064 INT PIN */
/* Routed pin properties */
#define BOARD_INITPINS_RT1064_INT_PIN_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RT1064_INT_PIN_SIGNAL                                IO20   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
